garyPenhook/PIC-Assembler/edc/PIC18F16Q40.PIC
        <edc:SFRDef edc:access="nnnn----" edc:cname="WPUB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="WPUB" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x409">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WPUB4" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB5" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB6" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUB7" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="ODCONB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="ODCONB" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODCB4" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB5" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB6" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCB7" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="SLRCONB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="SLRCONB" edc:nzwidth="8" edc:por="1111----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLRB4" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB5" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB6" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRB7" edc:mask="0x1" edc:name="SLRB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="INLVLB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="INLVLB" edc:nzwidth="8" edc:por="1111----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INLVLB4" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB5" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB6" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLB7" edc:mask="0x1" edc:name="INLVLB0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBP" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBP" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBN" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBN" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBN4" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN5" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN6" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBN7" edc:mask="0x1" edc:name="IOCBN0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="IOCBF" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="IOCBF" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x40F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCBF4" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF5" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF6" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCBF7" edc:mask="0x1" edc:name="IOCBF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELC" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x410">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELC0" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC1" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC2" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC3" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC4" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC5" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC6" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELC7" edc:mask="0x1" edc:name="ANSELC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x411">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUC0" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC1" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC2" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC3" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC4" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC5" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC6" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUC7" edc:mask="0x1" edc:name="WPUC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
